window.onload = function () {
    const numberOfFood = 1;
    const dataArray = [
      "Середня",
      "1 година",
      "Борщ - це одна з найбільш відомих страв української кухні. Він складається з багатьох інгредієнтів, таких як картопля, морква, буряк, капуста, цибуля та м'ясо (зазвичай свинина або говядина).",
      "500 грамів свинини<br>2-3 картоплини<br>1 цибуля<br>2-3 головки часнику<br>2-3 лаврових листа<br>Сіль та перець за смаком<br>3-4 літри води",
      "Наріжте м'ясо на кубики та підсмажте його до золотистого кольору у глибокій каструлі або сковороді.",
      "Додайте нарізану цибулю та підсмажте разом із м'ясом до м'якості.",
      "Додайте нарізані овочі (картоплю, моркву, буряк та капусту) та підсмажте їх разом з м'ясом та цибулею протягом кількох хвилин.",
      "Додайте нарізану капусту та тушкуйте її разом з іншими інгредієнтами протягом 10-15 хвилин.",
      "Додайте нарізану зелень (петрушку та кріп) та додайте сіль та перець за смаком. Потім долийте воду та доведіть до кипіння.",
      "Зменшіть вогонь та доведіть до готовності протягом близько 30-40 хвилин.",
      "Подаємо зі сметаною та часником.",
      "Борщ - це одна з найпопулярніших страв української кухні. Його можна знайти у більшості ресторанів, які пропонують національну кухню, та в домашніх колекціях рецептів. Борщ - це смачна, поживна та задовільна страва, яка відображає культурну спадщину України."
    ];
    const hardSpan = document.getElementById("hard-span");
    const timeSpan = document.getElementById("time-span");
    const paragraphs = document.getElementsByTagName("p");
    const images = document.getElementsByClassName("food-img");
    images[0].src = `img/receipt_db/${numberOfFood}/history.png`;
    images[1].src = `img/front_img/${numberOfFood}.jpg`;
    images[2].src = `img/receipt_db/${numberOfFood}/step.png`;
    
    // Задати внутрішній HTML для елементів з id
    hardSpan.innerHTML = dataArray[0];
    timeSpan.innerHTML = dataArray[1];

    // Задати внутрішній HTML для елементів <p>
    for (let i = 0; i < paragraphs.length; i++) {
        paragraphs[i].innerHTML = dataArray[i+2];
    }
};